Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.Guid
The Guid class represents the GUID filter expression.

Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.Guid.#ctor
Initializes a new instance of the Guid class.